"""
Выведите на экран все четные числа кратные пяти в интервале от 2 до 100 (включительно).
"""

for i in range(2, 100):
    if i % 5 == 0: print(i)
