"""
Напишите программу, которая вычисляет число n в m степени.
"""

n = float(input('Введите число: '))
m = float(input('Введите степень: '))

print(f'Число {n} в {m} степени: {n ** m}')
