"""
Напишите программу, которая конвертирует введенное пользователем десятичное число в шестнадцатеричную систему счисления.
"""

num = int(input('Введите число: '))
print(f'Число {num} в шестнадцатеричной системе счисления: {hex(num)}')
