"""
Напишите программу пересчета расстояния из верст в километры (1 верста = 1.0668 км).
"""

v = float(input("Введите расстояние в верстах: "))
print(f"Расстояние в киллометрах: {round(v * 1.0668, 2)}")