"""
Напишите программу, которая выводит строку, введенную пользователем, задом наперед.
"""

print('Строка задом наперед:', input('Введите строку: ')[::-1])